#include <bits/stdc++.h>

using namespace std;

int n;
bool judge = true;  //judge为true是玩家1执行命令，judge为false是玩家2执行命令

struct node{
	int att;        //攻击
	int heal;       //生命
}aa[1005],bb[1005];

vector<node> a,b;   //玩家1和玩家2

int main(){
	cin >> n;
	
	cin.get();  //吃掉回车符
	string action;
	/*
		因为随从下标从1开始，所以下标0存储英雄角色
	*/
	aa[0].att = 0;aa[0].heal = 30;
	bb[0].att = 0;bb[0].heal = 30;
	a.push_back(aa[0]);
	b.push_back(bb[0]);
	
	/*
        进行存储和判别
	*/
	for(int i = 1; i <= n; i++){
		/*
            为了解决字符串和数字以及空格类型（回车、空格等）之间的输入，直接都是字符串
            以回车结束getline(cin,action);
            以空格断开line >> 变量;
		*/
		getline(cin,action);
		istringstream line(action);
		line >> action;
		
		if(action == "summon"){
			string p,att,heal;
			int p1,att1,heal1;
			
   			line >> p >> att >> heal;
   			/*
                通过atoi(str.c_str())将字符串转换为数字类型
			*/
   			p1 = atoi(p.c_str());
   			att1 = atoi(att.c_str());
   			heal1 = atoi(heal.c_str());
   			
			if(judge){      //玩家1操作
				int j = a.size();
				aa[j].att = att1;
				aa[j].heal = heal1;
				a.insert(a.begin()+p1,aa[j]);
			}else{          //玩家2操作
				int j = b.size();
				bb[j].att = att1;
				bb[j].heal = heal1;
				b.insert(b.begin()+p1,bb[j]);
			}
		}else if(action == "end"){  //一个玩家结束，另一个玩家开始，取反
			judge = !judge;
		}else if(action == "attack"){   //某个玩家主杀
			string att1,att2;
			int attr1, attr2;
			
			line >> att1 >> att2;
			
			attr1 = atoi(att1.c_str());
			attr2 = atoi(att2.c_str());
			
			/*
                如果为玩家2操作杀戮，第一个输入的是玩家2的随从的坐标，调换一下
			*/
			if(!judge){
				int temp = attr1;
				attr1 = attr2;
				attr2 = temp;
			}
			
			/*
                杀戮之后进行玩家1话玩家2的随从的生命值计算存储
			*/
			b[attr2].heal -= a[attr1].att;
			a[attr1].heal -= b[attr2].att;
			
			/*
                某个玩家的随从生命<=0时，已死，删除,
				attr2 != 0是如果英雄死了，不应该删除英雄
			*/
			if(b[attr2].heal <= 0 && attr2 != 0){
				b.erase(b.begin()+attr2);
			}
			if(a[attr1].heal <= 0 && attr1 != 0){
				a.erase(a.begin()+attr1);
			}
		}
		
		if(a[0].heal <= 0 || b[0].heal <= 0){
			break;
		}
		
	}
	
	
	/*
        当时脑子抽风了，竟然写了个cout << a[0].heal-b[0].heal << endl;
        导致只有70分，我差点疯了，啊啊啊啊啊啊啊啊啊啊啊啊啊！！！！！！！！！
	*/
	
	if(a[0].heal <= 0){
		cout << "-1\n";
	}else if(b[0].heal <= 0){
		cout << "1\n" ;
	}else{
		cout << "0\n";
	}

	cout << a[0].heal << "\n" << a.size()-1 << " " ;
	
	for(int i = 1; i < a.size(); i++){
		cout << a[i].heal << " ";
	}
	cout << "\n" << b[0].heal << "\n" << b.size()-1 << " ";
	for(int i = 1; i < b.size(); i++){
		cout << b[i].heal << " ";
	}
	
	return 0;
}

/*=================================================================
输入
8
summon 1 3 6
summon 2 4 2
end
summon 1 4 5
summon 1 2 1
attack 1 2
end
attack 1 1
输出
0
30
1 2
30
1 2
=================================================================*/
/*
问题描述
　　《炉石传说：魔兽英雄传》（Hearthstone: Heroes of Warcraft，简称炉石传说）是暴雪娱乐开发的一款集换式卡牌游
戏（如图03.jpg所示）。游戏在一个战斗棋盘上进行，由两名玩家轮流进行操作，本题所使用的炉石传说游戏的简化规则如下：
* 玩家会控制一些角色，每个角色有自己的生命值和攻击力。当生命值小于等于 0 时，该角色死亡。角色分为英雄和随从。
　　* 玩家各控制一个英雄，游戏开始时，英雄的生命值为 30，攻击力为 0。当英雄死亡时，游戏结束，英雄未死亡的一方获胜。
　　* 玩家可在游戏过程中召唤随从。棋盘上每方都有 7 个可用于放置随从的空位，从左到右一字排开，被称为战场。当随从死
亡时，它将被从战场上移除。
　　* 游戏开始后，两位玩家轮流进行操作，每个玩家的连续一组操作称为一个回合。
　　* 每个回合中，当前玩家可进行零个或者多个以下操作：
　　1) 召唤随从：玩家召唤一个随从进入战场，随从具有指定的生命值和攻击力。
　　2) 随从攻击：玩家控制自己的某个随从攻击对手的英雄或者某个随从。
　　3) 结束回合：玩家声明自己的当前回合结束，游戏将进入对手的回合。该操作一定是一个回合的最后一个操作。
　　* 当随从攻击时，攻击方和被攻击方会同时对彼此造成等同于自己攻击力的伤害。受到伤害的角色的生命值将会减少，数值等
同于受到的伤害。例如，随从 X 的生命值为 HX、攻击力为 AX，随从 Y 的生命值为 HY、攻击力为 AY，如果随从 X 攻击随从 Y，
则攻击发生后随从 X 的生命值变为 HX - AY，随从 Y 的生命值变为 HY - AX。攻击发生后，角色的生命值可以为负数。
　　本题将给出一个游戏的过程，要求编写程序模拟该游戏过程并输出最后的局面。
输入格式
　　输入第一行是一个整数 n，表示操作的个数。接下来 n 行，每行描述一个操作，格式如下：
　　<action> <arg1> <arg2> ...
　　其中<action>表示操作类型，是一个字符串，共有 3 种：summon表示召唤随从，attack表示随从攻击，end表示结束回合。这
3 种操作的具体格式如下：
　　* summon <position> <attack> <health>：当前玩家在位置<position>召唤一个生命值为<health>、攻击力为<attack>的随从。
其中<position>是一个 1 到 7 的整数，表示召唤的随从出现在战场上的位置，原来该位置及右边的随从都将顺次向右移动一位。
　　* attack <attacker> <defender>：当前玩家的角色<attacker>攻击对方的角色 <defender>。<attacker>是 1 到 7 的整数，
表示发起攻击的本方随从编号，<defender>是 0 到 7 的整数，表示被攻击的对方角色，0 表示攻击对方英雄，1 到 7 表示攻击对
方随从的编号。
　　* end：当前玩家结束本回合。
　　注意：随从的编号会随着游戏的进程发生变化，当召唤一个随从时，玩家指定召唤该随从放入战场的位置，此时，原来该位置
及右边的所有随从编号都会增加 1。而当一个随从死亡时，它右边的所有随从编号都会减少 1。任意时刻，战场上的随从总是从1开
始连续编号。
输出格式
　　输出共 5 行。
　　第 1 行包含一个整数，表示这 n 次操作后（以下称为 T 时刻）游戏的胜负结果，1 表示先手玩家获胜，-1 表示后手玩家获胜，
0 表示游戏尚未结束，还没有人获胜。
　　第 2 行包含一个整数，表示 T 时刻先手玩家的英雄的生命值。
　　第 3 行包含若干个整数，第一个整数 p 表示 T 时刻先手玩家在战场上存活的随从个数，之后 p 个整数，分别表示这些随从在
T 时刻的生命值（按照从左往右的顺序）。
　　第 4 行和第 5 行与第 2 行和第 3 行类似，只是将玩家从先手玩家换为后手玩家。

样例输入
8
summon 1 3 6
summon 2 4 2
end
summon 1 4 5
summon 1 2 1
attack 1 2
end
attack 1 1
样例输出
0
30
1 2
30
1 2
样例说明
　　按照样例输入从第 2 行开始逐行的解释如下：
　　1. 先手玩家在位置 1 召唤一个生命值为 6、攻击力为 3 的随从 A，是本方战场上唯一的随从。
　　2. 先手玩家在位置 2 召唤一个生命值为 2、攻击力为 4 的随从 B，出现在随从 A 的右边。
　　3. 先手玩家回合结束。
　　4. 后手玩家在位置 1 召唤一个生命值为 5、攻击力为 4 的随从 C，是本方战场上唯一的随从。
　　5. 后手玩家在位置 1 召唤一个生命值为 1、攻击力为 2 的随从 D，出现在随从 C 的左边。
　　6. 随从 D 攻击随从 B，双方均死亡。
　　7. 后手玩家回合结束。
　　8. 随从 A 攻击随从 C，双方的生命值都降低至 2。
评测用例规模与约定
　　* 操作的个数0 ≤ n ≤ 1000。
　　* 随从的初始生命值为 1 到 100 的整数，攻击力为 0 到 100 的整数。
　　* 保证所有操作均合法，包括但不限于：
　　1) 召唤随从的位置一定是合法的，即如果当前本方战场上有 m 个随从，则召唤随从的位置一定在 1 到 m + 1 之间，其中 1 表
示战场最左边的位置，m + 1 表示战场最右边的位置。
　　2) 当本方战场有 7 个随从时，不会再召唤新的随从。
　　3) 发起攻击和被攻击的角色一定存在，发起攻击的角色攻击力大于 0。
　　4) 一方英雄如果死亡，就不再会有后续操作。
　　* 数据约定：
　　前 20% 的评测用例召唤随从的位置都是战场的最右边。
　　前 40% 的评测用例没有 attack 操作。
　　前 60% 的评测用例不会出现随从死亡的情况。
*/
