#include <bits/stdc++.h>

using namespace std;

int n;
int a[1001];

int main(){
	
	cin >> n;
	
	for(int i = 0; i < n; i++){
		cin >> a[i];
	}
	
	sort(a,a+n);
	
	int c = 1;
	int max = 0;
	int data = a[0];
	for(int i = 1; i < n; i++){
		if(a[i] == a[i-1]){
			c++;
			if(max < c){
				max = c;
				data = a[i];
			}
		}else{
			c = 1;
		}
	}
	
	cout << data;
	
	return 0;
}

/*=================================================================
输入
6
10 1 10 20 30 20
输出
10
=================================================================*/
/*
问题描述
　　给定n个正整数，找出它们中出现次数最多的数。如果这样的数有多个，请输出其中最小的一个。
输入格式
　　输入的第一行只有一个正整数n(1 ≤ n ≤ 1000)，表示数字的个数。
　　输入的第二行有n个整数s1, s2, …, sn (1 ≤ si ≤ 10000, 1 ≤ i ≤ n)。相邻的数用空格分隔。
输出格式
　　输出这n个次数中出现次数最多的数。如果这样的数有多个，输出其中最小的一个。
样例输入
6
10 1 10 20 30 20
样例输出
10
*/
